
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.НомерТиража) Тогда
		Запись.НомерТиража = ПолучитьНомерПоследнегоТиража() + 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьНовыйНомерПоследнегоТиража();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	МассивЧисел = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаЧисел, "/");
	
	Если МассивЧисел.Количество() < 7 Тогда
		Возврат;
	КонецЕсли;
	
	Для Сч = 1 По 7 Цикл
		
		Запись["Число" + Сч] = МассивЧисел[Сч - 1]; 
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция ПолучитьНомерПоследнегоТиража()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоследнийНомерТиража_7_49.НомерТиража КАК НомерТиража
		|ИЗ
		|	РегистрСведений.ПоследнийНомерТиража_7_49 КАК ПоследнийНомерТиража_7_49";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НомерТиража;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаписатьНовыйНомерПоследнегоТиража()
	
	МенеджерЗаписи = РегистрыСведений.ПоследнийНомерТиража_7_49.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.НомерТиража = Запись.НомерТиража;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти